import {Review} from '../types/review';

export const reviews: Review[] = [
  {
    id: 1,
    user: {
      id: 11,
      name: 'Kate Muir',
    },
    rating: 8.8,
    comment: 'Discerning travellers and Wes Anderson fans will luxuriate in the glorious Mittel-European kitsch of one of the director\'s funniest and most exquisitely designed movies in years.',
    date: 'December 20, 2016',
  }, {
    id: 2,
    user: {
      id: 12,
      name: 're-D-Rum',
    },
    rating: 9.9,
    comment: 'Вот благодаря именно таким фильмам, можно смело говорить, что советский кинематограф считается одним из лучших в мире(конечно, если очистить его от политически-иеологизированной шелухи, которой тоже наснимали огого сколько)! Фильм, который можно пересматривать раз за разом и хохотать практически до потери пульса, потому что практически каждая фраза - это маленький лаконичный шедевр. Многие реплики стали афоризмами и до сих пор широко используются в быту.',
    date: 'December 20, 2016',
  }, {
    id: 3,
    user: {
      id: 33,
      name: 'Вадим',
    },
    rating: 5.5,
    comment: 'Я люблю советские фильмы. И комедии, и драмы, и военные фильмы. Но первые мне по душе в исполнении Гайдая, а не Рязнова. Увы, но данный пациент сделан по рязановскому шаблону.',
    date: 'December 20, 2016',
  }, {
    id: 4,
    user: {
      id: 24,
      name: 'Алексей',
    },
    rating: 6.5,
    comment: 'Мне понравился Мэттью МакКонахи, повороты сюжета, стиль повествования. Колин Фаррелл со своим ирландским акцентом был просто великолепен.',
    date: 'December 20, 2016',
  }, {
    id: 5,
    user: {
      id: 15,
      name: 'Анфиса',
    },
    rating: 9.7,
    comment: 'Гай Ричи порадовал. Не разделяю негативные рецензии, тех, кто считает, что режиссер выдохся или еще что в этом духе. по мне так фильм качественный и со своей ролью справился. Настроение поднимает, в напряжении держит, актеры - красавчики. И особенно порадовал саундтрек и костюмы. Хочу теперь спортивные костюмы, в которых там танцуют ребята)',
    date: 'December 20, 2016',
  }, {
    id: 6,
    user: {
      id: 56,
      name: 'Ольга',
    },
    rating: 9.3,
    comment: 'Каждый из нас рано или поздно начинает жаловаться на жизнь. В фильме ведется речь о главном герое, в прошлом был бизнесмен и получил серьезную травму, в следствии чего стал инвалидом. Также фигурировало второй главные герой - темнокожий мужчина из бедной семьи, который искал способ заработать средства.',
    date: 'December 20, 2016',
  }, {
    id: 7,
    user: {
      id: 47,
      name: 'Stee',
    },
    rating: 6.2,
    comment: 'Ни в коем случае не ставлю под сомнение мастерство Тарантино или актёркую игру целой плеяды звёздных имён, но где смысл? Именно смысл я считаю главным критерием при создании фильма. Сюжет. Сценарий. Да не просто сценарий, а',
    date: 'December 20, 2016',
  }, {
    id: 8,
    user: {
      id: 18,
      name: 'Turkevich',
    },
    rating: 8.6,
    comment: 'Эту кинокартину многие считают едва ли не классикой боевика. Ожидания были очень высокие, но не сказал бы, что фильм их полностью оправдал. На мой взгляд — это крепкий боевичок с определённой долей чёрного юмора, но в нем нет какого-либо посыла. Это фильм ради фильма.',
    date: 'December 20, 2016',
  },
];
